---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeConstraintSegmentLength
source: html/2a586cd5-c52f-3d9f-9a6e-be72f0670164.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintSegmentLength

A constraint that controls the length of a segment.

## Syntax (C#)
```csharp
public class RebarShapeConstraintSegmentLength : RebarShapeConstraint
```

## Remarks
The constraint has two references, indexed by 0 and 1, that do not have to
 correspond to the start and end of the segment.